fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРабот</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРабот.Resource.ВКМ_Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРабот.Dimension.ВКМ_Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВКМ_ГрафикРабот</name>
    <type>
      <types>CatalogRef.ВКМ_ТипыГрафиков</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРабот/ВКМ_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРабот</name>
  <resources>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ТипГрафика</name>
    <type>
      <types>CatalogRef.ВКМ_ТипыГрафиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>ВКМ_Сотрудники</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Специалисты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ВКМ_Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ВКМ_Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/CommonModules/ВКМ_ПроведениеРасчетов/Module.bsl
#Область СлужебныеПроцедурыИФункции
Процедура ВКМ_Рассчитать(НаборЗаписей, Регистратор) Экспорт     
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияФактическийПериодДействия.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
		|	ВКМ_ОсновныеНачисленияФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец,
		|	ВКМ_ОсновныеНачисленияФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
		|	ВКМ_ОсновныеНачисленияФактическийПериодДействия.ВКМ_Сотрудник КАК ВКМ_Сотрудник
		|ПОМЕСТИТЬ ВтНачисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ФактическийПериодДействия КАК ВКМ_ОсновныеНачисленияФактическийПериодДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ВыплатаЗарплатыВКМ_Сотрудники.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	СУММА(ВКМ_ВыплатаЗарплатыВКМ_Сотрудники.ВКМ_Сумма) КАК ВКМ_Сумма
		|ПОМЕСТИТЬ ВтВыплаты
		|ИЗ
		|	Документ.ВКМ_ВыплатаЗарплаты.ВКМ_Сотрудники КАК ВКМ_ВыплатаЗарплатыВКМ_Сотрудники
		|ГДЕ
		|	ВКМ_ВыплатаЗарплатыВКМ_Сотрудники.Ссылка.Проведен
		|	И ВКМ_ВыплатаЗарплатыВКМ_Сотрудники.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыплатаЗарплатыВКМ_Сотрудники.ВКМ_Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВКМ_ГрафикиРабот.ВКМ_Значение) КАК ВКМ_Значение
		|ПОМЕСТИТЬ ВтКоличествоРабочихДней
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикиРабот КАК ВКМ_ГрафикиРабот
		|ГДЕ
		|	ВКМ_ГрафикиРабот.ВКМ_ТипГрафика = &Пятидневка
		|	И ВКМ_ГрафикиРабот.ВКМ_Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВКМ_ГрафикиРабот.ВКМ_Значение) КАК ВКМ_Значение
		|ПОМЕСТИТЬ ВтКоличествоРабочихДнейМесяц
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикиРабот КАК ВКМ_ГрафикиРабот
		|ГДЕ
		|	ВКМ_ГрафикиРабот.ВКМ_ТипГрафика = &Пятидневка
		|	И ВКМ_ГрафикиРабот.ВКМ_Дата МЕЖДУ &ДатаНачалаМесяц И &ДатаОкончанияМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВтВыплаты.ВКМ_Сумма, 0) КАК Выплачено,
		|	ВтКоличествоРабочихДней.ВКМ_Значение КАК КоличествоРабочихДней,
		|	ВтНачисления.НомерСтроки КАК НомерСтроки,
		|	ВтНачисления.ВидРасчета КАК ВидРасчета,
		|	РАЗНОСТЬДАТ(ВтНачисления.ПериодДействияНачало, ВтНачисления.ПериодДействияКонец, ДЕНЬ) + 1 КАК КоличествоДнейКалендарных,
		|	ВтНачисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВтКоличествоРабочихДнейМесяц.ВКМ_Значение КАК КоличествоРабочихДнейМесяц,
		|	СУММА(ВКМ_ГрафикиРабот.ВКМ_Значение) КАК ВКМ_Значение
		|ПОМЕСТИТЬ ВтИтог
		|ИЗ
		|	ВтНачисления КАК ВтНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКоличествоРабочихДней КАК ВтКоличествоРабочихДней
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВыплаты КАК ВтВыплаты
		|		ПО ВтНачисления.ВКМ_Сотрудник = ВтВыплаты.ВКМ_Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКоличествоРабочихДнейМесяц КАК ВтКоличествоРабочихДнейМесяц
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ГрафикиРабот КАК ВКМ_ГрафикиРабот
		|		ПО (ВКМ_ГрафикиРабот.ВКМ_Дата МЕЖДУ ВтНачисления.ПериодДействияНачало И ВтНачисления.ПериодДействияКонец)
		|			И (ВКМ_ГрафикиРабот.ВКМ_ТипГрафика = &Пятидневка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтНачисления.НомерСтроки,
		|	ВтНачисления.ВидРасчета,
		|	ВтНачисления.ВКМ_Сотрудник,
		|	ЕСТЬNULL(ВтВыплаты.ВКМ_Сумма, 0),
		|	ВтКоличествоРабочихДней.ВКМ_Значение,
		|	ВтКоличествоРабочихДнейМесяц.ВКМ_Значение,
		|	РАЗНОСТЬДАТ(ВтНачисления.ПериодДействияНачало, ВтНачисления.ПериодДействияКонец, ДЕНЬ) + 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтИтог.Выплачено КАК Выплачено,
		|	ВтИтог.КоличествоРабочихДней КАК КоличествоРабочихДней,
		|	ВтИтог.НомерСтроки КАК НомерСтроки,
		|	ВтИтог.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВтИтог.КоличествоДнейКалендарных) КАК КоличествоДнейКалендарных,
		|	ВтИтог.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВтИтог.КоличествоРабочихДнейМесяц КАК КоличествоРабочихДнейМесяц,
		|	СУММА(ВтИтог.ВКМ_Значение) КАК КоличествоОтработанныхЧасов
		|ИЗ
		|	ВтИтог КАК ВтИтог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтИтог.Выплачено,
		|	ВтИтог.КоличествоРабочихДней,
		|	ВтИтог.НомерСтроки,
		|	ВтИтог.ВидРасчета,
		|	ВтИтог.ВКМ_Сотрудник,
		|	ВтИтог.КоличествоРабочихДнейМесяц";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДобавитьМесяц(Регистратор.ВКМ_ПериодРегистрации, -12)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДобавитьМесяц(Регистратор.ВКМ_ПериодРегистрации, -1)));
	Запрос.УстановитьПараметр("ДатаНачалаМесяц", НачалоМесяца(Регистратор.ВКМ_ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаОкончанияМесяц", КонецМесяца(Регистратор.ВКМ_ПериодРегистрации));
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("Пятидневка", Справочники.ВКМ_ТипыГрафиков.НайтиПоКоду("000000001"));
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	СтруктураПоиска = Новый Структура("НомерСтроки");  
	
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки = ТекЗапись.НомерСтроки;
		Пока РезультатЗапроса.НайтиСледующий(СтруктураПоиска) Цикл 
			Если РезультатЗапроса.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад Тогда 
				ТекЗапись.ВКМ_Сумма = (ТекЗапись.ВКМ_Сумма * (РезультатЗапроса.КоличествоОтработанныхЧасов / 8)) / (РезультатЗапроса.КоличествоРабочихДнейМесяц / 8); // 50000 / 22 * 12 
			ИначеЕсли РезультатЗапроса.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск Тогда
				ТекЗапись.ВКМ_Сумма = (РезультатЗапроса.Выплачено / (РезультатЗапроса.КоличествоРабочихДней / 8)) * Окр(((ТекЗапись.ПериодДействияКонец - ТекЗапись.ПериодДействияНачало) / 86400 + 1), 0, РежимОкругления.Окр15как20);
			КонецЕсли;	
		КонецЦикла;
		
		РезультатЗапроса.Сбросить();
	КонецЦикла;
	
	НаборЗаписей.Записать(,, Ложь);
КонецПроцедуры
#КонецОбласти
